; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	GroundStation3 - direction
	GroundStation5 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	GroundStation0 - direction
	GroundStation10 - direction
	Star1 - direction
	Star2 - direction
	Star4 - direction
	GroundStation6 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star9)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation10)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon14)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star2)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star15)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 GroundStation0)
	(pointing satellite2 Star2)
	(have_image Star11 thermograph0)
	(have_image Planet12 thermograph0)
	(have_image Star13 spectrograph1)
	(have_image Phenomenon14 spectrograph1)
	(have_image Star15 spectrograph1)
	(have_image Planet16 thermograph0)
))

)

; plan
1. (turn_to satellite1 groundstation10 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 groundstation10)
   goals met: 0 of 9
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite1 instrument2 groundstation10)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite1 planet16 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 planet16)
   goals met: 0 of 9
5. (take_image satellite1 planet16 instrument2 thermograph0)
   added: (have_image planet16 thermograph0)
   goals met: 1 of 9
6. (turn_to satellite1 planet12 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet12)
   goals met: 1 of 9
7. (take_image satellite1 planet12 instrument2 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon14 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon14)
   goals met: 2 of 9
9. (turn_to satellite0 star2 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star2)
   goals met: 3 of 9
10. (take_image satellite1 phenomenon14 instrument2 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 4 of 9
11. (turn_to satellite1 star11 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 star11)
   goals met: 4 of 9
12. (take_image satellite1 star11 instrument2 thermograph0)
   added: (have_image star11 thermograph0)
   goals met: 5 of 9
13. (turn_to satellite1 star13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star13)
   goals met: 5 of 9
14. (take_image satellite1 star13 instrument2 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 6 of 9
15. (turn_to satellite1 star15 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star15)
   goals met: 6 of 9
16. (take_image satellite1 star15 instrument2 spectrograph1)
   added: (have_image star15 spectrograph1)
   goals met: 7 of 9
17. (turn_to satellite1 groundstation0 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 groundstation0)
   goals met: 8 of 9
18. (turn_to satellite2 star2 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star2)
   goals met: 9 of 9
